NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <stdbool.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_rx;
DMA_HandleTypeDef hdma_spi1_tx;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
///TODO: refactor constants below
bool received_ir_signal = false;

const    uint8_t tx_data = 0b10101101;
const    uint8_t tx_total_bits = 8;
volatile uint8_t tx_current_bit_position = 0;
volatile uint8_t tx_bit = 0;

         uint8_t rx_data = 0;
         uint8_t rx_total_bits = 8;
volatile uint8_t rx_current_bit_position = 0;
volatile uint8_t rx_bit = 0;


int level[100] = {0};
int pwm[100] = {0};
int pwidth[100] = {0};
int ind = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void TIM3_Init_helper(void);
static void MX_TIM4_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//TODO: specify timer constants
// values below are numbers of timer ticks
const uint16_t PeriodOfStartStopBits = 1000;
const uint16_t PeriodOfDataBits = 2000;
const uint16_t PeriodBetweenDataFrames = 5000;
const uint16_t HalfPeriodOfStartStopBits = 500;
const uint16_t HalfPeriodOfDataBits = 1000;

enum ReceiverStates
{
    RX_WAITING_FOR_START_BIT,
    RX_START_BIT_SENDING,
    RX_START_BIT_SENT,
    RX_DATA_RECEIVING,
    RX_DATA_RECEIVED,
    RX_STOP_BIT_RECEIVING,
    RX_STOP_BIT_RECEIVED
};
volatile uint8_t ReceiverState = RX_WAITING_FOR_START_BIT;

enum TransmitterStates
{
    TX_WAITING_FOR_TRANSMISSION,
    TX_SENDING_START_BIT,
    TX_SENDING_DATA,
    TX_SENDING_STOP_BIT,
    TX_DELAY
};
volatile uint8_t TransmitterState = TX_WAITING_FOR_TRANSMISSION;

enum StartStopSequenceStates
{
    STAGE_0,
    STAGE_ON1,
    STAGE_ON1_OFF1,
    STAGE_OFF1,
    STAGE_OFF1_ON2,
    STAGE_FALL2,
    STAGE_OFF2,
    STAGE_OFF,
    STAGE_ON2
};
volatile uint8_t StartStopSequenceTransmitState = STAGE_ON1;
volatile uint8_t StartStopSequenceReceiveState = STAGE_ON1;

const uint8_t max_delta_pwm_period = 2;
const uint8_t max_delta_pwm_width = 1;

// level 1
void pwm_transmit();
void pwm_receive();
void send_data();

// level 2
void enable_config_timer_carrier();
void enable_config_timer_envelop();
void enable_config_ir_gpio();
void choose_message();
void send_data_frame();
void send_protocol_frame();
void transmit_handler();
void receive_handler();
void IC_receive_handler();
void test_input_signal_high_low();

// level 3
void generate_binary_for_ir_frame();
void convert_ir_frame_to_manchester_format();
void transform_binary_from_msb_to_lsb();
void convert_binary_to_pwm_format();

// level 4
void force_envelop_timer_output_on();
void force_envelop_timer_output_off();
void send_start_stop_sequence();

inline void nop();

HAL_StatusTypeDef HAL_TIM_IC_PWM_Start_IT (TIM_HandleTypeDef *htim);

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  //MX_TIM2_Init();
  //MX_TIM3_Init();
  //TIM3_Init_helper();
  MX_TIM4_Init();

  /* USER CODE BEGIN 2 */
  //HAL_TIM_IC_Start_IT(&htim2, TIM_CHANNEL_1);
  //HAL_TIM_IC_Start_IT(&htim2, TIM_CHANNEL_2);
  //HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_1);
  //HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_2);

  //HAL_TIM_IC_PWM_Start_IT(&htim2);
  HAL_TIM_IC_PWM_Start_IT(&htim4);

