NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
  HAL_TIM_IC_Init(&htim4);


  /// TIM_TI1_SetConfig
//  ● Select the active input for TIMx_CCR1: write the CC1S bits to 01 in the TIMx_CCMR1 register (TI1 selected).
    //SET_BIT(htim4.Instance->CCMR1, TIM_CCMR1_CC1S_0);

//  ● Select the active polarity for TI1FP1 (used both for capture in TIMx_CCR1 and counter clear):
//    write the CC1P bit to ‘0’ (active on rising edge).
    //SET_BIT(htim4.Instance->CCMR1, TIM_CCER_CC1P)
    sConfigIC.ICFilter = 0;
    sConfigIC.ICPolarity = TIM_ICPOLARITY_RISING;
    sConfigIC.ICSelection = TIM_ICSELECTION_DIRECTTI;
    HAL_TIM_IC_ConfigChannel(&htim4, &sConfigIC, TIM_CHANNEL_1);

//  ● Select the active input for TIMx_CCR2: write the CC2S bits to 10 in the TIMx_CCMR1  register (TI1 selected).
//  ● Select the active polarity for TI1FP2 (used for capture in TIMx_CCR2): write the CC2P bit to ‘1’ (active on falling edge).
    sConfigIC.ICFilter = 0;
    sConfigIC.ICPolarity = TIM_ICPOLARITY_FALLING;// TIM_ICPOLARITY_RISING? TODO
    sConfigIC.ICSelection = TIM_ICSELECTION_INDIRECTTI;
    HAL_TIM_IC_ConfigChannel(&htim4, &sConfigIC, TIM_CHANNEL_1);//TIM_CHANNEL_2? TODO
//  ● Select the valid trigger input: write the TS bits to 101 in the TIMx_SMCR register (TI1FP1 selected).
//  ● Configure the slave mode controller in reset mode: write the SMS bits to 100 in the TIMx_SMCR register.
    sSlaveConfig.InputTrigger = TIM_TS_TI1FP1;
    sSlaveConfig.SlaveMode = TIM_SLAVEMODE_RESET;
    HAL_TIM_SlaveConfigSynchronization(&htim4, &sSlaveConfig);
//  ● Enable the captures: write the CC1E and CC2E bits to ‘1’ in the TIMx_CCER register.


}

HAL_StatusTypeDef HAL_TIM_IC_PWM_Start_IT (TIM_HandleTypeDef *htim)
{
  /* Check the parameters */
  assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, TIM_CHANNEL_1));
  assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, TIM_CHANNEL_2));

  /* Enable the TIM Capture/Compare 1 interrupt */
  __HAL_TIM_ENABLE_IT(htim, TIM_IT_CC1);
  /* Enable the TIM Capture/Compare 2 interrupt */
  __HAL_TIM_ENABLE_IT(htim, TIM_IT_CC2);

  /* Enable the Input Capture channel */
  TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_1, TIM_CCx_ENABLE);
  TIM_CCxChannelCmd(htim->Instance, TIM_CHANNEL_2, TIM_CCx_ENABLE);


  /* Enable the Peripheral */
  __HAL_TIM_ENABLE(htim);

  /* Return function status */
  return HAL_OK;
}
/** 
  * Enable DMA controller clock
  */
void MX_DMA_Init(void) 
{
  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
  HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  // GPIO Ports Clock Enable
  __GPIOD_CLK_ENABLE();
  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();

  //Configure GPIO pin : PA1 Timer2 Channel1
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  //Configure GPIO pin : PA2
  GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  //Configure GPIO pin : PA3
  GPIO_InitStruct.Pin = GPIO_PIN_3;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  //Configure GPIO pin : PA4
  GPIO_InitStruct.Pin = GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  //Configure GPIO pin : PB6  Timer 4 Channel 1
  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void pwm_transmit()
{

    enable_config_timer_carrier();
    enable_config_timer_envelop();
    enable_config_ir_gpio();
    choose_message();
    send_data_frame();

}
void pwm_receive()
{


}
void send_data()
{
    if(TX_WAITING_FOR_TRANSMISSION == TransmitterState)
    {
        TransmitterState = TX_SENDING_START_BIT;
    }
    else
    {
        //TODO: handle this case
        // data is still being transmitted. Need to finish previous transmission before starting next one
    }
}

void enable_config_timer_carrier(){}
void enable_config_timer_envelop(){}
void enable_config_ir_gpio(){}
void choose_message()
{

}
void send_data_frame()
{
    // disable_tim_interrupts
    __HAL_TIM_DISABLE_IT(&htim3, TIM_IT_CC1);

    generate_binary_for_ir_frame();
    convert_ir_frame_to_manchester_format();

    // enable_tim_interrupts
    __HAL_TIM_ENABLE_IT(&htim3, TIM_IT_CC1);
}
void send_protocol_frame()
{
    ///generate_binary_for_ir_frame();
    ///transform_binary_from_msb_to_lsb();
    ///convert_binary_to_pwm_format();

    // TODO: get total bit number
    do
    {
        // k-th bit of n: (n >> k) & 1
        tx_bit = (tx_data >> tx_current_bit_position) & 1;
        if(tx_bit == 1)
        {
            force_envelop_timer_output_on();

        }
        else // bit == 0
        {
            force_envelop_timer_output_off();

        }

        tx_current_bit_position++;
    } while (tx_current_bit_position < tx_total_bits);

}
void transmit_handler()
{
    /* Send data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     */
    // htim3 forming envelop
    // htim2 generates PWM

    switch(TransmitterState)
    {
        case TX_WAITING_FOR_TRANSMISSION:
        {
            nop();
            break;
        }
        case TX_SENDING_START_BIT:
        {
            htim3.Instance->ARR = PeriodOfStartStopBits;

            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                    // High
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_ON1_OFF1;
                    force_envelop_timer_output_on();
                    break;
                }
                    // Low
                case STAGE_ON1_OFF1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF;
                    //force_envelop_timer_output_off(); done anyway in timer interrupt handler
                    break;
                }
                    // High
                case STAGE_OFF:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }
                   // Low
                case STAGE_ON2:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    TransmitterState = TX_SENDING_DATA;
                    break;
                }
            }
            break;
        } 
        case TX_SENDING_DATA:
        {
            htim3.Instance->ARR = PeriodOfDataBits;

            // send current bit of data
            if(tx_current_bit_position < tx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                tx_bit = (tx_data >> tx_current_bit_position) & 1;
                if(tx_bit == 1)
                {
                    force_envelop_timer_output_on();
                }
                else // bit == 0
                {
                    force_envelop_timer_output_off();
                }
                tx_current_bit_position++;
            }
            // TODO: check nessesity of condition below
            else  // change to next state
            {
                tx_current_bit_position = 0;

                //TransmitterState = TX_DATA_SENT;
                TransmitterState = TX_SENDING_STOP_BIT;

                /* Set the Autoreload value for start sequence bits*/
                htim3.Instance->ARR = PeriodOfStartStopBits;
            }
            // TODO: check if some errors or other options are possible here?
            break;
        }
        case TX_SENDING_STOP_BIT:
        {
            // TODO: check if worth to move ARR update to step abore

