NikolayBobovnikov/ircapture/auvir_embed/mocap/receiver/stm32f103/Src/main.c
            }
            break;
        }
        // Transitiolal state, adjust timer period so that we start readind data bits in the middle of each signal
        case RX_START_BIT_SENT:
        {
            // start reading data bits after HalfPeriodOfDataBits
            htim4.Instance->ARR = HalfPeriodOfDataBits;
            ReceiverState = RX_DATA_RECEIVING;
            // initialize buffer with all zeros
            rx_data = 0;
            break;
        }

        case RX_DATA_RECEIVING:
        {
            //now reading data bits with period of PeriodOfDataBits ticks
            htim4.Instance->ARR = PeriodOfDataBits;
            // send current bit of data
            if(rx_current_bit_position < rx_total_bits)  // change to next state
            {
                // k-th bit of n: (n >> k) & 1
                if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                {
                    // set bit at the inversed position
                    rx_data |= 1 << (rx_total_bits - rx_current_bit_position -1);
                }
                /*
                 * below is redundant since all rx_data bits are initialized to zeros
                else
                {
                    //rx_bit = 0;
                    rx_data |= 0 << rx_current_bit_position;
                }
                */
                rx_current_bit_position++;
            }
            else
            {
                rx_data;// received data is here
                rx_current_bit_position = 0;
                ReceiverState = RX_DATA_RECEIVED;
                // wait remaining HalfPeriodOfDataBits before [the delay before] stop bit sequence
                htim3.Instance->ARR = HalfPeriodOfDataBits;
            }

            break;
        }
        case RX_DATA_RECEIVED:
        {
            TransmitterState = RX_STOP_BIT_RECEIVING;
            // wait half of the delay before stop bit sequence
            htim3.Instance->ARR = HalfPeriodOfStartStopBits;
            break;
        }
        case RX_STOP_BIT_RECEIVING:
        {
            switch (StartStopSequenceReceiveState)
            {
                case STAGE_ON1:
                {
                    // we are in the middle of delay before stop bit sequence, line should be low
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                    {
                        // continue reading stop bit sequence with PeriodOfStartStopBits interval
                        htim3.Instance->ARR = PeriodOfStartStopBits;
                        StartStopSequenceReceiveState = STAGE_ON1_OFF1;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_ON1;
                    }
                    break;
                }
                case STAGE_ON1_OFF1:
                {
                    // we are in the place of first bit of stop sequence, line should be high
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        StartStopSequenceReceiveState = STAGE_OFF;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_ON1;
                    }
                    break;
                }
                case STAGE_OFF:
                {
                    // we are in the place of delay between 2 bits of stop sequence, line should be low
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                    {
                        StartStopSequenceReceiveState = STAGE_ON2;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_ON1;
                    }
                    break;
                }
                case STAGE_ON2:
                {
                    // we are in the place of 2 bit of stop sequence, line should be high
                    if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET)
                    {
                        StartStopSequenceReceiveState = STAGE_ON1;
                        ReceiverState = RX_STOP_BIT_RECEIVED;
                    }
                    else
                    {
                        ReceiverState = RX_WAITING_FOR_START_BIT;
                        StartStopSequenceReceiveState = STAGE_ON1;
                    }
                    break;
                }
            }

            break;
        }
        case RX_STOP_BIT_RECEIVED:
        {
            // immediately after stop sequence, line should be low
            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
            {
                // we successfully received data, send corresponding event for listeners to read from the data buffer
                // TODO
                rx_data;
            }
            else
            {
                ReceiverState = RX_WAITING_FOR_START_BIT;
                StartStopSequenceReceiveState = STAGE_ON1;
                // TODO: check necessity
                //htim4.Instance->ARR = HalfPeriodOfStartStopBits;
            }
            break;
        }
    } // switch(ReceiverState)
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
    if(ind == 100)
    {
        ind = 0;
    }
}

void IC_receive_handler()
{
    /* Receive data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     *
     * Check data integrity. If OK, data is received
     */

    /* 1. Waiting for start bit
     * 2. Input capture channel: rising edge detected. Start timer, wait 1/2 of period
     * 3. 1/2 period check: if signal is high, start bit is received, goto 4, otherwise stop timer, goto 1
     * 4. 1/2 + i period check: read timer signal, increment received bits count
     * 5. If rbc == total_bits, wait for stop bit
     * 6. Check stop bit: if signal is high, stop timer, save received data, update event (?), goto 1
     *
     */
    switch(ReceiverState)
    {
        case RX_WAITING_FOR_START_BIT:
        {
            // This should be on IC event
            if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
            {
              if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
              {
                  htim4.Instance->ARR = HalfPeriodOfStartStopBits;
                  ReceiverState = RX_START_BIT_SENDING;
                  StartStopSequenceReceiveState = STAGE_ON1;
                  // wait for half a period of startstop bit sequence
              }
            }
            break;
        }
        case RX_START_BIT_SENDING:
        {
            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceReceiveState)
            {
                //High confirmed: STAGE_0 -> STAGE_ON1 confirmation
                case STAGE_ON1:
                {
                    // This should be on update event
                    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_UPDATE) != RESET)
                    {
                        if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_SET) //high level is confirmed, continue reading start sequence
                        {
                            htim4.Instance->ARR = PeriodOfStartStopBits;
                            StartStopSequenceTransmitState = STAGE_ON1_OFF1;
                            break;
                        }
                    }
                    ReceiverState = RX_WAITING_FOR_START_BIT;
                    StartStopSequenceReceiveState = STAGE_0;
                    break;
                }
                //Low: STAGE_ON1 -> STAGE_OFF1 input capture
                case STAGE_ON1_OFF1:
                {
                    // falling edge should be detected
                    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC2) != RESET)
                    {
                        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC2) != RESET) //current level is low, continue reading start sequence
                        {
                            // TODO: check pulse width, should be HalfPeriodOfStartStopBits
                            if( abs(htim4.Instance->CCR2 - HalfPeriodOfStartStopBits) <  max_delta_pwm_period)
                            {
                                StartStopSequenceTransmitState = STAGE_OFF1;
                                break;
                            }
                        }
                    }
                    ReceiverState = RX_WAITING_FOR_START_BIT;
                    StartStopSequenceReceiveState = STAGE_0;
                    break;
                }
                //Low: STAGE_OFF1 confirmation
                case STAGE_OFF1:
                {
                    // This should be on update
                    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_UPDATE) != RESET)
                    {
                        if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_UPDATE) != RESET)
                        {
                            if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6) == GPIO_PIN_RESET)
                            {
                                htim4.Instance->ARR = HalfPeriodOfStartStopBits;
                                StartStopSequenceReceiveState = STAGE_OFF1_ON2;
                                // wait for half a period of startstop bit sequence
                                break;
                            }
                        }
                    }
                    ReceiverState = RX_WAITING_FOR_START_BIT;
                    StartStopSequenceReceiveState = STAGE_0;
                    break;
                }
                //High: STAGE_OFF1 -> STAGE_ON2 input capture
                case STAGE_OFF1_ON2:
                {
                    // This should be on IC event (2nd bit - rising edge)
                    if(__HAL_TIM_GET_FLAG(&htim4, TIM_FLAG_CC1) != RESET)
                    {
                      if(__HAL_TIM_GET_IT_SOURCE(&htim4, TIM_IT_CC1) != RESET)
                      {
                          // TODO: check width of first bit pulse (HalfPeriodOfStartStopBits): here or at STAGE_ON1_OFF1?

